<template>
  <Overlay
    class="final-cards"
  >
    <h2>سناریو {{ this.gameSettings.scenario }}</h2>
    <br></br>
    <ul style="direction: rtl">
      <li v-for="(item, index) in dictionary[this.gameSettings.scenario]" :key="item">
        {{ index + 1 }}. {{ item }}
      </li>
    </ul>
    <br></br>
    <BaseButton
      class="white has-small-top-margin"
      @clicked="closeLog()"
    >
      <span>
        {{ $t('common.Close') }}
      </span>
    </BaseButton>
  </Overlay>
</template>

<script>

export default { 
  name: 'GameCharacterWakeUp',
  data() {
    return {
      dictionary: {
        "بازپرس": [
          "محقق",
          "تیم مافیا",
          "شیاد به تنهایی",
          "کارآگاه",
          "پزشک",
          "بازپرس",
          "تک‌تیرانداز (اگر در نقش‌ها باشد)",
        ],
        "تکاور": [
          "نگهبان",
          "گروگان‌گیر (به تنهایی)",
          "تیم مافیا (به جز گروگان‌گیر)",
          "کارآگاه",
          "تکاور",
          "پزشک",
          "تفنگ‌دار",
        ],
        "مذاکره": [
        "تیم مافیا",
          "کارآگاه",
          "تک‌تیرانداز",
          "پزشک",
          "خبرنگار (اگر مذاکره شده باشد)",
        ],
        "زودیاک": [
          "تیم مافیا (آلکاپن شات، شعبده‌باز قابلیت‌گیری، بمب‌گذار بمب)",
          "حرفه‌ای",
          "دکتر",
          "کارآگاه",
          "تفنگ‌دار",
          "اوشن",
          "(شب‌های زوج) زودیاک",
        ],
        "پدرخوانده": [
          "نوستراداموس (فقط شب معارفه) (اگر در نقش‌ها باشد)",
          "شرلوک (اگر در نقش‌ها باشد)",
          "تیم مافیا (پدرخوانده شات، ماتادور قابلیت‌گیری، سوال‌گودمن خرید)",
          "دکتر",
          "لئون",
          "همشهری‌کین",
          "کنستانتین",
          "جک‌گنجشکه (حتی شب معارفه) (اگر در نقش‌ها باشد)",
        ],
        "نماینده": [
          "تیم مافیا",
          "پزشک",
          "راهنما",
          "محافظ",
          "مین‌گذار",
          "وکیل",
        ],
        "فیلیمو": [
          "خواب‌گرد (اگر استفاده کند مافیاها بیدار نمی‌شوند)",
          "دکتر شهر",
          "تیم مافیا",
          "دکتر لکتر",
          "جوکر",
          "حرفه‌ای",
          "فروشنده",
          "کارآگاه",
          "روانشناس",
          "جان‌سخت",
          "شهردار (اگر در روز افراد در دفاع بیش از ۲ نفر باشد)",
        ],
        "میتیک": [
          "تیم مافیا (گادفادر شات، جنیتوری داریم؟ کانسورتی؟)",
          "بادیگارد",
          "دکتر",
          "اسنایپر",
          "دیتکتیو",
        ],
        "دربار": [
          "شب‌گرد",
          "درباریان",
          "شمشیرساز",
          "مفتش",
          "مهمات‌چی",
          "طبیب",
          "کاتب",
          "کشیش",
        ],
        "ارتش سری": [
          "کسلر بازی لایک بده",
          "خلبان لایک بده",
          "دکتر لایک بده",
          "کرتیس چشماش رو باز کنه و لایک‌ها رو ببینه",
          "دو گشتاپو بیدار شن و کسلر بهشون لایک بده",
        ],
        "ضد": [],
        "گرگ": [
          "تیم مافیا (رییس مافیا شات، افسون‌گر قابلیت‌گیری، جراح سیو)",
          "دکتر شهر",
          "کارآگاه",
          "کلانتر",
          "تفنگ‌ساز",
          "کشیش",
          "شکارچی",
          "(هر سه شب) گرگ",
          "شهردار (اگر در روز افراد در دفاع بیش از ۲ نفر باشد)",
        ],
        "شب مافیا": [],
      },
    };
  },
  methods: {
    closeLog () {
      this.$emit('close', 'wakeup')
    }
  }
}
</script>
