<template>
  <Overlay
    class="final-cards"
  >
    <h2>سناریو {{ this.gameSettings.scenario }}</h2>
    <br></br>
    <ul style="direction: rtl">
      <li v-for="(item, index) in dictionary[this.gameSettings.scenario]" :key="item">
        {{ index + 1 }}. {{ item }}
      </li>
    </ul>
    <BaseButton
      class="white has-small-top-margin"
      @clicked="closeLog()"
    >
      <span>
        {{ $t('common.Close') }}
      </span>
    </BaseButton>
  </Overlay>
</template>

<script>

export default { 
  name: 'GameCharacterWakeUp',
  data() {
    return {
      dictionary: {
        "بازپرس": [
          "محقق",
          "تیم مافیا",
          "شیاد به تنهایی",
          "کارآگاه",
          "پزشک",
          "بازپرس",
          "تک‌تیرانداز (اگر در نقش‌ها باشد)",
        ],
        "تکاور": [
          "نگهبان",
          "گروگان‌گیر (به تنهایی)",
          "تیم مافیا (به جز گروگان‌گیر)",
          "کارآگاه",
          "تکاور",
          "پزشک",
          "تفنگ‌دار",
        ],
        "مذاکره": [
        "تیم مافیا",
          "کارآگاه",
          "تک‌تیرانداز",
          "پزشک",
          "خبرنگار (اگر مذاکره شده باشد)",
        ],
        "زودیاک": [
          "تیم مافیا (آلکاپن شات، شعبده‌باز قابلیت‌گیری، بمب‌گذار بمب)",
          "حرفه‌ای",
          "دکتر",
          "کارآگاه",
          "تفنگ‌دار",
          "اوشن",
          "(شب‌های زوج) زودیاک",
        ],
        "پدرخوانده": [
          "نوستراداموس (فقط شب معارفه) (اگر در نقش‌ها باشد)",
          "شرلوک (اگر در نقش‌ها باشد)",
          "تیم مافیا (پدرخوانده شات، ماتادور قابلیت‌گیری، سوال‌گودمن خرید)",
          "دکتر",
          "لئون",
          "همشهری‌کین",
          "کنستانتین",
          "جک‌گنجشکه (اگر در نقش‌ها باشد)",
        ],
        "نماینده": [],
        "فیلیمو": [],
        "میتیک": [],
        "دربار": [],
        "ارتش سری": [],
        "ضد": [],
        "گرگ": [],
        "شب مافیا": [],
      },
    };
  },
  methods: {
    closeLog () {
      this.$emit('close', 'wakeup')
    }
  }
}
</script>
